# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

tap "buo/cask-upgrade"
tap "eugenmayer/dockersync"
tap "heroku/brew"
tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
tap "homebrew/services"
# tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"

brew "asdf"                                 # Extendable version manager
brew "autoconf"                             # Configuration shell script maker
brew "bash"                                 # Bourne again shell
brew "bash-completion"                      # Autocompletions for `bash`
brew "colordiff"                            # Colour-highlighted diff output
brew "direnv"                               # Directory specific env variables
# brew "flake8"                               # Python style guide enforcer
# brew "fswatch"                              # File change monitor
# brew "geoip"                                # Geographic IP lookup
# brew "gnupg"                                # GNU privacy guard
# brew "htop"                                 # Interactive system-monitor
# brew "graphicsmagick"                      # GraphicsMagick image processor
# brew "imagemagick"                         # ImageMagick image processor
# brew "jpegoptim"                            # JPEG compressor/optimizer
brew "less"                                 # Terminal pager
brew "lesspipe"                             # Input filter for `less`
# brew "micro"                                # Micro text editor
brew "nano"                                 # Nano text editor
# brew "npm"                                  # Node package manager
# brew "optipng"                             # PNG compressor/optimizer
# brew "tidy-html5"                           # HTML corrector
brew "neofetch"                             # System information tool
# brew "pipenv"                               # Python packaging tool
# brew "postgresql", restart_service: true    # PostgreSQL RDBMS
# brew "pyenv"                                # Python version manager
# brew "pyenv-virtualenv"                     # virtualenv and conda manager
# brew "ruby-build"                           # Ruby version managger
# brew "rbenv"                                # Ruby environment manager
brew "ripgrep"                              # Recursive Regex search tool
brew "rsync"                                # File transfer and sync tool
# brew "screenfetch"                          # Screenshot information tool
# brew "starship"                             # Starship cross-shell prompt
# brew "telnet"                               # Virtual terminal client
# brew "tmux"
# brew "tmuxinator"                           # Tmux session controller
# brew "travis"                               # Travis CI client
# brew "unison"                               # Unison file synchronizer
brew "wget"                                 # Web content downloader
# brew "zlib"                                 # Lossless data-compression library
# brew "eugenmayer/dockersync/unox"           # Docker sync daemon 
# brew "heroku/brew/heroku"                   # Heroku CLI
brew "lazygit"                              # Lazygit GIT GUI
brew "openssl@1.1"                          # Open SSL 
# brew "go"                                   # GO
brew "neovim"
brew "starship"

# cask "android-platform-tools"               # Android SDK platform-tools
cask "amethyst"
cask "font-dejavu-sans-mono-nerd-font"   # DejaVu Sans Mono Nerd Font
cask "font-fira-code-nerd-font"             # Fira Code Nerd Font
cask "font-hack-nerd-font"                  # Hack Mono Nerd Font
# cask "powershell"                           # Cross-platform shell
# cask "alacritty"                            # Terminal Emulator
cask "wezterm"
cask "karabiner-elements"
